rgregg/esp32-wireless-thermostat/src/controller/panic_breadcrumb_hook.cpp
#include "controller/panic_breadcrumb_hook.h"

#if defined(ARDUINO)
#include "controller/panic_breadcrumb.h"
#include "esp_attr.h"
#include "esp32-hal.h"  // set_arduino_panic_handler, arduino_panic_info_t

namespace {

// RTC_NOINIT survives reset/panic — must outlive all C++ static destruction.
// __attribute__((used)) prevents linker GC before panic_breadcrumb_recover_on_boot
// is wired up in setup().
__attribute__((used)) RTC_NOINIT_ATTR thermostat::PanicBreadcrumb g_panic_breadcrumb;

// Called by Arduino's panic wrapper in panic context.
// No heap, no logging, no blocking — stamp and return.
void on_panic(arduino_panic_info_t *info, void * /*arg*/) {
  if (info == nullptr) return;

  g_panic_breadcrumb.magic = thermostat::kPanicBreadcrumbMagic;
  g_panic_breadcrumb.core = static_cast<uint32_t>(info->core);
  g_panic_breadcrumb.pc = reinterpret_cast<uint32_t>(info->pc);

  uint32_t flags = 0;
  if (info->backtrace_corrupt) flags |= thermostat::kPanicFlagBacktraceCorrupt;
  if (info->backtrace_continues) flags |= thermostat::kPanicFlagBacktraceContinues;
  g_panic_breadcrumb.flags = flags;

  size_t depth = info->backtrace_len;
  if (depth > thermostat::kPanicBacktraceDepth) depth = thermostat::kPanicBacktraceDepth;
  g_panic_breadcrumb.depth = static_cast<uint32_t>(depth);
  for (size_t i = 0; i < depth; ++i) {
    g_panic_breadcrumb.backtrace[i] = static_cast<uint32_t>(info->backtrace[i]);
  }

  // Copy the exception string LAST, and only after everything above is already
  // committed to RTC_NOINIT. info->reason points at a .rodata literal, i.e. DROM
  // reached through the flash cache — and one of the panics we want to identify
  // is precisely "Cache disabled but cached memory region accessed". If reading
  // it faults here, the pc/core/backtrace we already stamped still survive; only
  // the reason is lost. Clearing it first means a partial copy reads as absent
  // rather than as a stale string from an earlier panic.
  g_panic_breadcrumb.reason[0] = '\0';
  if (info->reason == nullptr) return;
  char *dst = g_panic_breadcrumb.reason;
  const char *src = info->reason;
  size_t i = 0;
  for (; i + 1 < thermostat::kPanicReasonLen && src[i] != '\0'; ++i) {
    dst[i] = src[i];
  }
  dst[i] = '\0';
}

// We use the Arduino core's official extension point set_arduino_panic_handler()
// rather than defining our own __wrap_esp_panic_handler (the core already defines
// that symbol; a second definition would multiple-define).
//
// CRITICAL build requirement: the core's wrapper only takes effect if the firmware
// is LINKED with `-Wl,--wrap=esp_panic_handler`. Arduino IDE adds this via
// platform.txt; PlatformIO/pioarduino does NOT, so it is added explicitly in
// platformio.ini ([panic_wrap]). WITHOUT that flag the wrapper is dead code and
// on_panic is never called — the breadcrumb silently records nothing. (This was the
// real bug found by on-device validation: every boot recovered "none" and the
// selftest panic-looped.)
//
// Caveat: set_arduino_panic_handler keeps only ONE callback, so a later registration
// by any library would silently replace ours — acceptable here (no other panic hooks).
//
// Register at static-init time so panics during early setup() are captured
// even before panic_breadcrumb_recover_on_boot() is called.
__attribute__((constructor)) void register_panic_hook() {
  set_arduino_panic_handler(on_panic, nullptr);
}

}  // namespace

namespace thermostat {

void panic_breadcrumb_recover_on_boot(char *out, size_t out_len) {
  // Handler is already registered by the constructor above; nothing to do here
  // for registration.  Recover the breadcrumb from the previous boot and
  // invalidate it so it is reported exactly once.
  panic_breadcrumb_format(g_panic_breadcrumb, out, out_len);
  g_panic_breadcrumb.magic = 0;
  g_panic_breadcrumb.pc = 0;
}

}  // namespace thermostat

#else  // !ARDUINO

namespace thermostat {
void panic_breadcrumb_recover_on_boot(char *out, size_t out_len) {
  if (out != nullptr && out_len > 0) out[0] = '\0';
}
}  // namespace thermostat

#endif  // ARDUINO
